src/cf/InformationRegisters/узПроксиСерверы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>узПроксиСерверы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОценкаРаботоспособности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/узПроксиСерверы/Ext/ManagerModule.bsl
Функция ПолучитьМассивНастроекПроксиСерверов() Экспорт
	
	МассивНастроекПроксиСерверов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 5
		|	узПроксиСерверы.Адрес,
		|	узПроксиСерверы.Порт,
		|	узПроксиСерверы.Логин,
		|	узПроксиСерверы.Пароль,
		|	узПроксиСерверы.ОценкаРаботоспособности КАК ОценкаРаботоспособности
		|ИЗ
		|	РегистрСведений.узПроксиСерверы КАК узПроксиСерверы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОценкаРаботоспособности УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НастройкиПроксиСтруктура = Новый Структура;
		НастройкиПроксиСтруктура.Вставить("Адрес");
		НастройкиПроксиСтруктура.Вставить("Порт");
		НастройкиПроксиСтруктура.Вставить("Логин");
		НастройкиПроксиСтруктура.Вставить("Пароль");
		ЗаполнитьЗначенияСвойств(НастройкиПроксиСтруктура, Выборка);
		МассивНастроекПроксиСерверов.Добавить(НастройкиПроксиСтруктура);
	КонецЦикла;
	
	Возврат МассивНастроекПроксиСерверов;
	
КонецФункции

Процедура ИзменитьОценкуРаботоспособностиПроксиСервера(АдресПрокси, ПортПрокси, ИзменениеОценки = 0) Экспорт

	Запись = РегистрыСведений.узПроксиСерверы.СоздатьМенеджерЗаписи();
    Запись.Адрес = АдресПрокси;
	Запись.Порт = ПортПрокси;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		Возврат;
	КонецЕсли;	
	
	Запись.ОценкаРаботоспособности = Запись.ОценкаРаботоспособности + ИзменениеОценки;
	Запись.Записать();

КонецПроцедуры

Процедура ЗаполнитьНастройкамиПоУмолчанию() Экспорт
	
	Макет = РегистрыСведений.узПроксиСерверы.ПолучитьМакет("НастройкиПоУмолчанию");
	
	ТЗНастройкиПоУмолчанию= Новый ТаблицаЗначений();
	ТЗНастройкиПоУмолчанию.Колонки.Добавить("Адрес", Новый ОписаниеТипов("Строка"));
	ТЗНастройкиПоУмолчанию.Колонки.Добавить("Порт", Новый ОписаниеТипов("Число"));
	ТЗНастройкиПоУмолчанию.Колонки.Добавить("Логин", Новый ОписаниеТипов("Строка"));
	ТЗНастройкиПоУмолчанию.Колонки.Добавить("Пароль", Новый ОписаниеТипов("Строка"));
	
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		СтрокаТЗНастройкиПоУмолчанию = ТЗНастройкиПоУмолчанию.Добавить();		
		СтрокаТЗНастройкиПоУмолчанию.Адрес = СокрЛП(Макет.Область(НомерСтроки,1).Текст);
		СтрокаТЗНастройкиПоУмолчанию.Порт = Число(СокрЛП(Макет.Область(НомерСтроки,2).Текст));
		СтрокаТЗНастройкиПоУмолчанию.Логин = СокрЛП(Макет.Область(НомерСтроки,3).Текст);
		СтрокаТЗНастройкиПоУмолчанию.Пароль = СокрЛП(Макет.Область(НомерСтроки,4).Текст);
	КонецЦикла;
	
	НаборЗаписей = РегистрыСведений.узПроксиСерверы.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(ТЗНастройкиПоУмолчанию);
	НаборЗаписей.Записать();	
	
КонецПроцедуры
